package `Practical work4`
fun nationality(c: String):String{
    return when (c) {
        "США" -> """
            ______________________________________________
            |   Национальность: Американец/Американка    |
            |                                            |
            |https://ru.wikipedia.org/wiki/Американцы_США|
            \--------------------------------------------/
            """
        "Россия" -> """
            _____________________________________________
            |    Национальность: Россиянен/Россиянка    |
            |                                           |
            |   https://ru.wikipedia.org/wiki/Россияне  |
            \-------------------------------------------/
            """
        "Япония" -> """
            _____________________________________________
            |       Национальность: Японец/Японка       |
            |                                           |
            |   https://ru.wikipedia.org/wiki/Японцы    |
            \-------------------------------------------/
            """
        "Канада" -> """
            _____________________________________________
            |      Национальность: Канадец/Канадка      |
            |                                           |
            |   https://ru.wikipedia.org/wiki/Канадцы   |
            \-------------------------------------------/
            """
        "Франция" -> """
            _____________________________________________
            |   Национальность: Француз/Француженка     |
            |                                           |
            |   https://ru.wikipedia.org/wiki/Французы  |
            \-------------------------------------------/
            """
        "Германия" -> """
            _____________________________________________
            |       Национальность: Немец/Немка         |
            |                                           |
            |   https://ru.wikipedia.org/wiki/Немцы     |
            \-------------------------------------------/
            """
        "Италия" -> """
            _____________________________________________
            |   Национальность: Итальянец/Итальянка     |
            |                                           |
            |   https://ru.wikipedia.org/wiki/Итальянцы |
            \-------------------------------------------/
            """
        "Индия" -> """
            ________________________________________________
            |       Национальность: Индиец/Индийка         |
            |                                              |
            |https://ru.wikipedia.org/wiki/Население_Индии |
            \----------------------------------------------/
            """
        else -> "Неизвестная страна. Пожалуйста, введите одну из поддерживаемых стран."
    }
}
fun main() {
    println("Введите страну (США, Россия, Япония и т.д.):")
    val country = readlnOrNull()
    println(country?.let { nationality(it) })

}