package `Practical work1`

fun main() {
    println("Int - предназначен для хранения целых чисел. Диапазон чисел от -2 147 483 648 до 2 147 483 647.")
    println("uint - предназначен для хранения целых положительных чисел. Диапазон чисел от 0 до 4 294 967.")
    println("double  - для создания чисел с плавающей точкой. Диапазон чисел от от ±4.9*10-324 до ±1.8*10308.")
    println("bool - логический тип данных. Предназначен для записи истинного (true) или ложного (false) значения.")
    println("char - тип данных для работы с символами. Позволяет поместить в одинарных кавычках какой-либо символ.")
    println("string - тип данных для текста. В двойных кавычках можно сохранить одно или множество слов.")
}